/**********************************************************
*Copyright(c) Automation Excellence Class
*FileName: Mouse.c
*Author: JH Yang
*Date:  2017/08/06
*Description: 设置鼠标
*Others: 包含三种鼠标图案
*Function List:
	1.extern void Set_VGAmode(void);

*History:
	1.Date:
      Author:
      Modification:

**********************************************************/

#include "SVGA.h"
#include "Mouse.h"
#include "head.h"

/*定义鼠标大小的长宽*/
const int MouseShapex = 16;
const int MouseShapey = 10;

/*一般样式鼠标--用于一般情形*/
const int MouseShape1[MouseShapex][MouseShapey] = {
		{1,0,0,0,0,0,0,0,0,0},
		{1,1,0,0,0,0,0,0,0,0},
		{1,2,1,0,0,0,0,0,0,0},
		{1,2,2,1,0,0,0,0,0,0},
		{1,2,2,2,1,0,0,0,0,0},
		{1,2,2,2,2,1,0,0,0,0},
		{1,2,2,2,2,2,1,0,0,0},
		{1,2,2,2,2,2,2,1,0,0},
		{1,2,2,2,2,2,2,2,1,0},
		{1,2,2,2,2,2,2,1,1,1},
		{1,2,2,2,2,2,2,1,0,0},
		{1,2,2,2,2,2,2,1,0,0},
		{1,2,1,1,1,2,2,1,0,0},
		{1,1,0,0,0,1,2,2,1,0},
		{0,0,0,0,0,1,2,2,1,0},
		{0,0,0,0,0,0,1,1,1,0},
	};

/*手型鼠标--用于图标选择*/
const int MouseShape2[MouseShapex][MouseShapey] = {
		{0,1,1,1,0,0,0,0,0,0},
		{0,1,2,1,0,0,0,0,0,0},
		{0,1,2,1,0,0,0,0,0,0},
		{0,1,2,1,0,0,0,0,0,0},
		{0,1,2,1,1,1,0,0,0,0},
		{0,1,2,1,2,1,1,1,0,0},
		{0,1,2,1,2,1,2,1,1,1},
		{1,1,2,2,2,1,2,1,2,1},
		{1,2,2,2,2,2,2,1,2,1},
		{1,2,2,2,2,2,2,2,2,1},
		{1,2,2,2,2,2,2,2,2,1},
		{1,1,2,2,2,2,2,2,2,1},
		{0,1,1,2,2,2,2,2,2,1},
		{0,0,1,1,2,2,2,2,1,1},
		{0,0,0,1,1,2,2,1,1,0},
		{0,0,0,0,1,1,1,1,0,0},
	};

/*输入鼠标--用于文本框选择*/
const int MouseShape3[MouseShapex][MouseShapey] = {
		{1,1,1,1,0,0,1,1,1,1},
		{1,1,1,1,0,0,1,1,1,1},
		{0,0,0,0,1,1,0,0,0,0},
		{0,0,0,0,1,1,0,0,0,0},
		{0,0,0,0,1,1,0,0,0,0},
		{0,0,0,0,1,1,0,0,0,0},
		{0,0,0,0,1,1,0,0,0,0},
		{0,0,0,0,1,1,0,0,0,0},
		{0,0,0,0,1,1,0,0,0,0},
		{0,0,0,0,1,1,0,0,0,0},
		{0,0,0,0,1,1,0,0,0,0},
		{0,0,0,0,1,1,0,0,0,0},
		{0,0,0,0,1,1,0,0,0,0},
		{0,0,0,0,1,1,0,0,0,0},
		{1,1,1,1,0,0,1,1,1,1},
		{1,1,1,1,0,0,1,1,1,1},
	};

/*鼠标遮挡的背景缓存数组，全局变量，BK是background的缩写*/
int Mouse_BK[16][10];

/*************************************************
*Function: void MouseInit(void);
*Description: 初始化鼠标
*Calls: // 被本函数调用的函数清单
*Input: mode : 无;
*Output: 错误信息
*Return: a.ax 0000 不支持
*			  ffff 支持	
*Others: 无
*************************************************/
void MouseInit(void)
{

	union REGS uRegs;

	/*设置鼠标功能号*/
	uRegs.a.ax = 0;
	int86(0x33,&uRegs,&uRegs);

	/*返回错误信息*/
	if(uRegs.a.ax == 0x0000)
	{
		printf("The mouse failed to initialize!");
		delay(5000);
		exit(1)
	}
}

/*************************************************
*Function: void Set_MouseRange(int ,int ,int ,int);
*Description: 设置鼠标的移动范围
*Calls: // 被本函数调用的函数清单
*Input: mode : 无;
*Output: 错误信息
*Return: 无
*Others: 无
*************************************************/

void Set_MouseRange(int x1,int y1,int x2,int y2)
{
	union REGS uRegs;
	
	/*设置横坐标范围*/
	uRegs.x.ax = 7;
	uRegs.x.cx = x1;
	uRegs.x.dx = x2;
	int86(0x33, &uRegs, &uRegs);
	
	/*设置纵坐标范围*/
	uRegs.x.ax = 8;
	uRegs.x.cx = y1;
	uRegs.x.dx = y2;
	int86(0x33, &uRegs, &uRegs);
}